//import { useAuth } from "../../hooks/useAuth";
//import "./styles.css"
    
const HomePage = () => {
    console.log(">>>Home page");
    //const auth = useAuth();

    return (<div>
                <div>
                    <h2>Home page</h2>
                    <p>можете спробувати зареєструватися і війти під новим аккаунтом</p>
                    <p>можете спробувати акаунт з правами адміна, логін admin та пароль admin</p>
                    <p>можна створити свії тудушки, поділитися ними з іншими зареєстрованими користувачами,</p>
                    <p>якщо ви знаєте їх пошту.</p>
                    <p>Адміністратори мають додатковий розділ, там можна дивитися список всіх користувачів, 
                        список всіх тутушок, а також, додавати, редагувати, видаляти, ділитися та переглядати 
                        більше властивостей.</p>
                    <p></p>
                </div>
            </div>
            
    )
}

export default HomePage;